; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared3 - mode
	infrared0 - mode
	infrared1 - mode
	infrared2 - mode
	Star1 - direction
	GroundStation5 - direction
	Star3 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument2 infrared0)
	(supports instrument2 infrared3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
)
(:goal (and
	(have_image Star6 infrared1)
	(have_image Star7 infrared0)
	(have_image Star8 infrared2)
	(have_image Star9 infrared2)
	(have_image Star10 infrared3)
	(have_image Planet11 infrared0)
	(have_image Phenomenon12 infrared2)
	(have_image Planet13 infrared0)
))

)

; plan
1. (turn_to satellite1 groundstation2 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 star8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star8)
   goals met: 0 of 8
5. (take_image satellite1 star8 instrument3 infrared2)
   added: (have_image star8 infrared2)
   goals met: 1 of 8
6. (turn_to satellite1 star10 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star10)
   goals met: 1 of 8
7. (take_image satellite1 star10 instrument3 infrared3)
   added: (have_image star10 infrared3)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon12 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon12 instrument3 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 3 of 8
10. (turn_to satellite1 star9 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star9)
   goals met: 3 of 8
11. (take_image satellite1 star9 instrument3 infrared2)
   added: (have_image star9 infrared2)
   goals met: 4 of 8
12. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 4 of 8
13. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 8
14. (turn_to satellite1 star0 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star0)
   goals met: 4 of 8
15. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 4 of 8
16. (turn_to satellite1 planet11 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet11)
   goals met: 4 of 8
17. (take_image satellite1 planet11 instrument2 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 5 of 8
18. (turn_to satellite1 planet13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet13)
   goals met: 5 of 8
19. (take_image satellite1 planet13 instrument2 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 6 of 8
20. (turn_to satellite1 star6 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star6)
   goals met: 6 of 8
21. (take_image satellite1 star6 instrument2 infrared1)
   added: (have_image star6 infrared1)
   goals met: 7 of 8
22. (turn_to satellite1 star7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star7)
   goals met: 7 of 8
23. (take_image satellite1 star7 instrument2 infrared0)
   added: (have_image star7 infrared0)
   goals met: 8 of 8
